# Parameter Type Id Array Instance Parameter Property

Source: https://www.revitapidocs.com/2026/4f634b0d-78d7-1457-f220-1c56242aa0f5.htm

---

| Parameter Type Id Array Instance Parameter Property |
| --- |

"Instance"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayInstanceParameter { get; }
```

```
Public Shared ReadOnly Property ArrayInstanceParameter As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayInstanceParameter {
	ForgeTypeId^ get ();
}
```

```
static member ArrayInstanceParameter : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace